下面给出一种可行的设计思路、地址规划、VLAN 划分以及设备 CLI 配置示例，保证 6 台 PC（PC14–PC19）跨交换机／路由器均可互通。

------

## 一、网络拓扑与地址规划

| 设备                   | 接口                   | 连接到        | 网络/用途         | 网段               | 网关     |
| ---------------------- | ---------------------- | ------------- | ----------------- | ------------------ | -------- |
| **Switch1** (纯 L2)    | Fa0/1 → PC14           | VLAN 10       | PC14 子网         | 10.0.0.0/24        | 10.0.0.1 |
|                        | Fa0/2 → Router3 (G0/2) | VLAN 10       | router3–switch    | *物理直连，无标签* |          |
|                        | Fa0/3 → PC15           | VLAN 20       | PC15 子网         | 20.0.0.0/24        | 20.0.0.1 |
|                        | Fa0/4 → Router3 (G0/3) | VLAN 20       | router3–switch    | *物理直连，无标签* |          |
| **Router0** (2911)     | Gi0/0                  | Switch1 Fa0/2 | VLAN10 GW         | 10.0.0.1/24        | —        |
|                        | Gi0/1                  | Switch1 Fa0/4 | VLAN20 GW         | 20.0.0.1/24        | —        |
|                        | Gi0/2                  | Router4 Gi0/0 | R3–R4 链路        | 100.0.0.0/30       | —        |
| **Switch2** (L2)       | Fa0/2 → PC16           | VLAN 30       | PC16 子网         | 30.0.0.0/24        | 30.0.0.1 |
|                        | Fa0/3 → PC17           | VLAN 40       | PC17 子网         | 40.0.0.0/24        | 40.0.0.1 |
|                        | Fa0/1 → Router4 Fa0/1  | Trunk (30,40) | 单臂路由链路      | 802.1Q             | —        |
| **Router4** (2911)     | Gi0/0                  | Router3 Gi0/2 | R3–R4 链路        | 100.0.0.2/30       | —        |
|                        | Gi0/1.30 (子接口)      | Switch2 Fa0/1 | VLAN30 GW         | 30.0.0.1/24        | —        |
|                        | Gi0/1.40 (子接口)      | Switch2 Fa0/1 | VLAN40 GW         | 40.0.0.1/24        | —        |
|                        | Gi0/2                  | Switch3 Fa0/1 | R4–Switch3        | 200.0.0.0/30       | —        |
| **Switch3** (3560, L3) | Fa0/2 → PC18           | VLAN 50       | PC18 子网         | 50.0.0.0/24        | 50.0.0.1 |
|                        | Fa0/3 → PC19           | VLAN 60       | PC19 子网         | 60.0.0.0/24        | 60.0.0.1 |
|                        | Fa0/1                  | Router4 Fa0/2 | 交换机–路由器链路 | 200.0.0.1/30       | —        |

------

## 二、设备配置示例

### 1. Switch1（2900，纯二层）

```shell
Switch1# configure terminal
! 创建 VLAN
Switch1(config)# vlan 10
Switch1(config-vlan)# exit
Switch1(config)# vlan 20
Switch1(config-vlan)# exit

! PC 和路由物理 uplink
Switch1(config)# interface fa0/1
Switch1(config-if)# switchport mode access
Switch1(config-if)# switchport access vlan 10
Switch1(config-if)# no shutdown
Switch1(config-if)# exit

Switch1(config)# interface fa0/3
Switch1(config-if)# switchport mode access
Switch1(config-if)# switchport access vlan 20
Switch1(config-if)# no shutdown
Switch1(config-if)# exit

! 两根 uplink 到 Router3，分别放到 VLAN10/20
Switch1(config)# interface fa0/2
Switch1(config-if)# switchport mode access
Switch1(config-if)# switchport access vlan 10
Switch1(config-if)# no shutdown
Switch1(config-if)# exit

Switch1(config)# interface fa0/4
Switch1(config-if)# switchport mode access
Switch1(config-if)# switchport access vlan 20
Switch1(config-if)# no shutdown
Switch1(config-if)# exit
Switch1(config)# end
```

### 2. Router3（2911）—— 两条物理 uplink 作双上行

```shell
Router3# configure terminal
! VLAN10 网关
Router3(config)# interface gigabitEthernet 0/0
Router3(config-if)# ip address 10.0.0.1 255.255.255.0
Router3(config-if)# no shutdown

! VLAN20 网关
Router3(config)# interface gigabitEthernet 0/1
Router3(config-if)# ip address 20.0.0.1 255.255.255.0
Router3(config-if)# no shutdown

! 和 R4 的点到点
Router3(config)# interface gigabitEthernet 0/2
Router3(config-if)# ip address 100.0.0.1 255.255.255.252
Router3(config-if)# no shutdown

! 静态路由：剩余 4 个网段都指向 R4
Router3(config)# ip route 30.0.0.0 255.255.255.0 100.0.0.2
Router3(config)# ip route 40.0.0.0 255.255.255.0 100.0.0.2
Router3(config)# ip route 50.0.0.0 255.255.255.0 100.0.0.2
Router3(config)# ip route 60.0.0.0 255.255.255.0 100.0.0.2
Router3(config)# end
```

### 3. Switch2（2960，L2）—— 单臂路由承载 VLAN30/40

```shell
Switch2# configure terminal
Switch2(config)# vlan 30
Switch2(config-vlan)# exit
Switch2(config)# vlan 40
Switch2(config-vlan)# exit

! PC16、PC17 接口
Switch2(config)# interface fa0/2
Switch2(config-if)# switchport mode access
Switch2(config-if)# switchport access vlan 30
Switch2(config-if)# no shutdown
Switch2(config-if)# exit

Switch2(config)# interface fa0/3
Switch2(config-if)# switchport mode access
Switch2(config-if)# switchport access vlan 40
Switch2(config-if)# no shutdown
Switch2(config-if)# exit

! uplink 到 Router4 的单臂链路
Switch2(config)# interface fa0/1
Switch2(config-if)# switchport mode trunk
Switch2(config-if)# switchport trunk allowed vlan 30,40
Switch2(config-if)# no shutdown
Switch2(config-if)# end
```

### 4. Router4（2911）—— 单臂 + 与其它设备点对点

```shell
Router4# configure terminal
! R3–R4 点对点
Router4(config)# interface gigabitEthernet 0/0
Router4(config-if)# ip address 100.0.0.2 255.255.255.252
Router4(config-if)# no shutdown

! 单臂路由：VLAN30/40
Router4(config)# interface gigabitEthernet 0/1.30
Router4(config-subif)# encapsulation dot1q 30
Router4(config-subif)# ip address 30.0.0.1 255.255.255.0
Router4(config-subif)# exit

Router4(config)# interface gigabitEthernet 0/1.40
Router4(config-subif)# encapsulation dot1q 40
Router4(config-subif)# ip address 40.0.0.1 255.255.255.0
Router4(config-subif)# exit

! R4–Switch3 点对点，为 L3 交换机外部链路
Router4(config)# interface gigabitEthernet 0/2
Router4(config-if)# ip address 200.0.0.2 255.255.255.252
Router4(config-if)# no shutdown

! 静态路由：VLAN10/20 去 R3，VLAN50/60 去 Switch3
Router4(config)# ip route 10.0.0.0 255.255.255.0 100.0.0.1
Router4(config)# ip route 20.0.0.0 255.255.255.0 100.0.0.1
Router4(config)# ip route 50.0.0.0 255.255.255.0 200.0.0.1
Router4(config)# ip route 60.0.0.0 255.255.255.0 200.0.0.1
Router4(config)# end
```

### 5. Switch3（3560，三层交换机）

```shell
Switch3# configure terminal
Switch3(config)# ip routing                       ! 启用三层转发

! 创建 VLAN50/60 及 SVI
Switch3(config)# vlan 50
Switch3(config-vlan)# exit
Switch3(config)# vlan 60
Switch3(config-vlan)# exit

Switch3(config)# interface vlan 50
Switch3(config-if)# ip address 50.0.0.1 255.255.255.0
Switch3(config-if)# no shutdown
Switch3(config-if)# exit

Switch3(config)# interface vlan 60
Switch3(config-if)# ip address 60.0.0.1 255.255.255.0
Switch3(config-if)# no shutdown
Switch3(config-if)# exit

! PC18/PC19 接口
Switch3(config)# interface fa0/2
Switch3(config-if)# switchport mode access
Switch3(config-if)# switchport access vlan 50
Switch3(config-if)# no shutdown
Switch3(config-if)# exit

Switch3(config)# interface fa0/3
Switch3(config-if)# switchport mode access
Switch3(config-if)# switchport access vlan 60
Switch3(config-if)# no shutdown
Switch3(config-if)# exit

! 上行到 Router4 的点对点——做成纯路由口
Switch3(config)# interface fa0/1
Switch3(config-if)# no switchport
Switch3(config-if)# ip address 200.0.0.1 255.255.255.252
Switch3(config-if)# no shutdown
Switch3(config-if)# exit

! 静态路由：其他 4 个网段都指向 Router4
Switch3(config)# ip route 10.0.0.0 255.255.255.0 200.0.0.2
Switch3(config)# ip route 20.0.0.0 255.255.255.0 200.0.0.2
Switch3(config)# ip route 30.0.0.0 255.255.255.0 200.0.0.2
Switch3(config)# ip route 40.0.0.0 255.255.255.0 200.0.0.2
Switch3(config)# end
```

------

## 三、主机 IP/GW 配置

| 主机 | IP 地址   | 掩码          | 默认网关 |
| ---- | --------- | ------------- | -------- |
| PC14 | 10.0.0.14 | 255.255.255.0 | 10.0.0.1 |
| PC15 | 20.0.0.15 | 255.255.255.0 | 20.0.0.1 |
| PC16 | 30.0.0.16 | 255.255.255.0 | 30.0.0.1 |
| PC17 | 40.0.0.17 | 255.255.255.0 | 40.0.0.1 |
| PC18 | 50.0.0.18 | 255.255.255.0 | 50.0.0.1 |
| PC19 | 60.0.0.19 | 255.255.255.0 | 60.0.0.1 |

------

至此，三个“路由器”（Router3、Router4、三层 Switch3）之间通过静态路由互告彼此的网段，6 个 PC 分别在各自子网，用对应设备的接口/子接口或 SVI 作为网关，互相 `ping` 即可通。